OdDbBaseHatchPE.isReallyHatch(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether a specified hatch is a real hatch.
\param pHatch     [in]  A pointer to a hatch object.
\returns Returns true if a hatch is a real hatch, otherwise returns false.
\remarks
For .dwg functionality a hatch is always a hatch protocol extension, but for .dgn functionality a hatch protocol extension can be added to any entity.

OdDbBaseHatchPE.isSolidFill(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether a specified hatch is a solid hatch.
\param pHatch     [in]  A pointer to a hatch object.
\returns Returns true if a hatch is a solid hatch, otherwise returns false.

OdDbBaseHatchPE.isGradient(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether a specified hatch is a gradient hatch.
\param pHatch     [in]  A pointer to a hatch object.
\returns Returns true if a hatch is a gradient hatch, otherwise returns false.

OdDbBaseHatchPE.hatchStyle(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the style of a specified hatch.
\param pHatch     [in]  A pointer to a hatch object.

OdDbBaseHatchPE.getLoopAt(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Int32,OdArray&lt;OdGePoint2d,OdMemoryAllocator&lt;OdGePoint2d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Double,OdMemoryAllocator&lt;System.Double&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns curves of a loop, determined by its index, in a specified hatch.
\param pHatch     [in]  A pointer to a hatch object.
\param loopIndex  [in]  An index of a hatch loop.
\param edgePtrs   [out] A reference to an OdGeCurve2d object array to store information about the curves that form the loop.

OdDbBaseHatchPE.getLoopAt(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Int32,OdArray&lt;OdGeCurve2d**,OdObjectsAllocator&lt;OdGeCurve2d**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns curves of a loop, determined by its index, in a specified hatch.
\param pHatch     [in]  A pointer to a hatch object.
\param loopIndex  [in]  An index of a hatch loop.
\param edgePtrs   [out] A reference to an OdGeCurve2d object array to store information about the curves that form the loop.

OdDbBaseHatchPE.loopTypeAt(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Int32)
\details
Returns the type of loop, determined by its index, in a specified hatch.
\param pHatch     [in] A pointer to a hatch object.
\param loopIndex  [in] An index of a hatch loop.

OdDbBaseHatchPE.numLoops(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the quantity of loops in a specified hatch.
\param pHatch [in] A pointer to a hatch object.